<?php if (!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die(); ?>

    <footer class="footer">
        <div class="container">
            <div class="footer__container">
                <div class="footer__row footer__top">
                    <a class="footer__logo footer__logo_link" href="/">
                        <svg class="footer__logo-img">
                            <use xlink:href="img/sprites/sprite.svg#logo"></use>
                        </svg>
                        <span class="footer__logo-text">web sphere</span>
                    </a>
                    <ul class="footer__menu-wrap">
                        <li>
                            <a href="#">о нас</a>
                        </li>
                        <li>
                            <a href="#">faq</a>
                        </li>
                        <li>
                            <a href="#">блог</a>
                        </li>
                        <li>
                            <a href="#">контакты</a>
                        </li>
                    </ul>
                </div>
                <div class="footer__row footer__contacts">
                    <div class="footer__contacts-item">телефон: <a href="tel:+79952525063">+7 (995) 252-50-63</a></div>
                    <div class="footer__contacts-item">e-mail: <a href="mailto:websphere.site@yandex.com">websphere.site@yandex.com</a>
                    </div>
                </div>
                <div class="footer__row footer__bottom">
                    <div class="footer__copyright">© web sphere 2025, all rights reserved</div>
                    <div class="footer__bottom-links">
                        <a class="footer__copyright" href="/policy" target="_blank" rel="noopener">политика конфиденциальности</a>
                        <a class="footer__copyright" href="/cookie" target="_blank" rel="noopener">политика использования файлов cookie</a>
                        <a class="footer__copyright" href="/agreement" target="_blank" rel="noopener">согласие на обработку персональных данных</a>
                    </div>
                </div>
            </div>
        </div>
    </footer>

    <div class="modal js-modal" id="callback">
        <div class="modal__wrapper modal-contact">
            <button class="js-button-close modal__btn-close" title="close" tabindex="0">
                <svg xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24" tabindex="-1">
                    <path d="m20 20l4 4m16 0l4 20"></path>
                </svg>
            </button>
            <div class="modal__inner modal-contact__inner">
                <div class="modal__title">обсудим проект?</div>
                <p class="modal-contact__text">привет! меня зовут александр, и я буду рад помочь с вашим проектом, можете позвонить по телефону <a
                        href="tel:+79952525063">+7 (995) 252-50-63</a> или связаться по контактам ниже</p>
                <div class="modal-contact__links">
                    <a class="modal-contact__link" href="#">
                        <svg width="40" height="40" viewbox="-1 -1  18 18" xmlns="http://www.w3.org/2000/svg"
                            class="bi bi-telegram">
                            <path d="m16 8a8 8 0 1 1 0 8a8 8 0 0 1 16 0zm8.287 5.906c-.778.324-2.334.994-4.666 2.01-.378.15-.577.298-.595.442-.03.243.275.339.69.47l.175.055c.408.133.958.288 1.243.294.26.006.549-.1.868-.32 2.179-1.471 3.304-2.214 3.374-2.23.05-.012.12-.026.166.016.047.041.042.12.037.141-.03.129-1.227 1.241-1.846 1.817-.193.18-.33.307-.358.336a8.154 8.154 0 0 1-.188.186c-.38.366-.664.64.015 1.088.327.216.589.393.85.571.284.194.568.387.936.629.093.06.183.125.27.187.331.236.63.448.997.414.214-.02.435-.22.547-.82.265-1.417.786-4.486.906-5.751a1.426 1.426 0 0 0-.013-.315.337.337 0 0 0-.114-.217.526.526 0 0 0-.31-.093c-.3.005-.763.166-2.984 1.09z"></path>
                        </svg>
                        <span>telegram</span>
                    </a>
                    <a class="modal-contact__link" href="#">
                        <svg width="40" height="40" viewbox="0 0 1024 1024" class="icon" xmlns="http://www.w3.org/2000/svg">
                            <path d="m713.5 599.9c-10.9-5.6-65.2-32.2-75.3-35.8-10.1-3.8-17.5-5.6-24.8 5.6-7.4 11.1-28.4 35.8-35 43.3-6.4 7.4-12.9 8.3-23.8 2.8-64.8-32.4-107.3-57.8-150-131.1-11.3-19.5 11.3-18.1 32.4-60.2 3.6-7.4 1.8-13.7-1-19.3-2.8-5.6-24.8-59.8-34-81.9-8.9-21.5-18.1-18.5-24.8-18.9-6.4-.4-13.7-.4-21.1-.4-7.4 0-19.3 2.8-29.4 13.7-10.1 11.1-38.6 37.8-38.6 92s39.5 106.7 44.9 114.1c5.6 7.4 77.7 118.6 188.4 166.5 70 30.2 97.4 32.8 132.4 27.6 21.3-3.2 65.2-26.6 74.3-52.5 9.1-25.8 9.1-47.9 6.4-52.5-2.7-4.9-10.1-7.7-21-13z"></path>
                            <path d="m925.2 338.4c-22.6-53.7-55-101.9-96.3-143.3-41.3-41.3-89.5-73.8-143.3-96.3c630.6 75.7 572.2 64 512 64h-2c-60.6.3-119.3 12.3-174.5 35.9-53.3 22.8-101.1 55.2-142 96.5-40.9 41.3-73 89.3-95.2 142.8-23 55.4-34.6 114.3-34.3 174.9.3 69.4 16.9 138.3 48 199.9v152c0 25.4 20.6 46 46 46h152.1c61.6 31.1 130.5 47.7 199.9 48h2.1c59.9 0 118-11.6 172.7-34.3 53.5-22.3 101.6-54.3 142.8-95.2 41.3-40.9 73.8-88.7 96.5-142 23.6-55.2 35.6-113.9 35.9-174.5.3-60.9-11.5-120-34.8-175.6zm-151.1 438c704 845.8 611 884 512 884h-1.7c-60.3-.3-120.2-15.3-173.1-43.5l-8.4-4.5h188v695.2l-4.5-8.4c155.3 633.9 140.3 574 140 513.7c-.4-99.7 37.7-193.3 107.6-263.8 69.8-70.5 163.1-109.5 262.8-109.9h1.7c50 0 98.5 9.7 144.2 28.9 44.6 18.7 84.6 45.6 119 80 34.3 34.3 61.3 74.4 80 119 19.4 46.2 29.1 95.2 28.9 145.8-.6 99.6-39.7 192.9-110.1 262.7z"></path>
                        </svg>
                        <span>whatsapp</span>
                    </a>
                </div>

                <p class="modal-contact__text">либо заполните форму и мы свяжемся с вами так быстро, как только сможем</p>
                <form class="form modal-contact__form">
                    <input type="hidden" name="type" value="form">
                    <input type="hidden" name="form_id" value="callback">
                    <input type="hidden" name="form_name" value="callback">
                    <label>
                        <input type="text" name="name" placeholder="имя" />
                    </label>
                    <label>
                        <input type="tel" name="phone" placeholder="телефон*" required>
                    </label>
                    <label>
                        <input type="email" name="email" placeholder="email">
                    </label>
                    <label class="checkbox-label">
                        <input type="checkbox" name="agree" required />
                        <span>
                            согласен на <a href="/agreement" target="_blank">обработку персональных данных</a>
                        </span>
                    </label>
                    <label class="checkbox-label">
                        <input type="checkbox" name="agree" required />
                        <span>
                            ознакомлен с <a href="/policy" target="_blank" class="">политикой конфиденциальности</a>
                        </span>
                    </label>
                    <input type="submit" class="simple-button simple-button_light" value="отправить">
                </form>
            </div>
        </div>
    </div>

    <div class="modal modal_info modal_success js-modal" id="popup">
        <div class="modal__wrapper">
            <button class="js-button-close modal__btn-close" title="close" tabindex="0">
                <svg xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24" tabindex="-1">
                    <path d="m20 20l4 4m16 0l4 20"></path>
                </svg>
            </button>
            <div class="modal__inner">
                <p class="modal__text js-modal-text">тексто об успешной отправке или ошибке, попробуйте еще раз</p>
            </div>
        </div>
    </div>

    <div class="contact-widget shake-right">
        <a href="#">
            <span class="visually-hidden">telegram</span>
            <svg width="80" height="80" viewbox="-1 -1  18 18" xmlns="http://www.w3.org/2000/svg" class="bi bi-telegram">
                <path d="m16 8a8 8 0 1 1 0 8a8 8 0 0 1 16 0zm8.287 5.906c-.778.324-2.334.994-4.666 2.01-.378.15-.577.298-.595.442-.03.243.275.339.69.47l.175.055c.408.133.958.288 1.243.294.26.006.549-.1.868-.32 2.179-1.471 3.304-2.214 3.374-2.23.05-.012.12-.026.166.016.047.041.042.12.037.141-.03.129-1.227 1.241-1.846 1.817-.193.18-.33.307-.358.336a8.154 8.154 0 0 1-.188.186c-.38.366-.664.64.015 1.088.327.216.589.393.85.571.284.194.568.387.936.629.093.06.183.125.27.187.331.236.63.448.997.414.214-.02.435-.22.547-.82.265-1.417.786-4.486.906-5.751a1.426 1.426 0 0 0-.013-.315.337.337 0 0 0-.114-.217.526.526 0 0 0-.31-.093c-.3.005-.763.166-2.984 1.09z" />
            </svg>
        </a>
        <a href="#">
            <span class="visually-hidden">whatsapp</span>
            <svg width="80" height="80" viewbox="0 0 1024 1024" class="icon" xmlns="http://www.w3.org/2000/svg">
                <path d="m713.5 599.9c-10.9-5.6-65.2-32.2-75.3-35.8-10.1-3.8-17.5-5.6-24.8 5.6-7.4 11.1-28.4 35.8-35 43.3-6.4 7.4-12.9 8.3-23.8 2.8-64.8-32.4-107.3-57.8-150-131.1-11.3-19.5 11.3-18.1 32.4-60.2 3.6-7.4 1.8-13.7-1-19.3-2.8-5.6-24.8-59.8-34-81.9-8.9-21.5-18.1-18.5-24.8-18.9-6.4-.4-13.7-.4-21.1-.4-7.4 0-19.3 2.8-29.4 13.7-10.1 11.1-38.6 37.8-38.6 92s39.5 106.7 44.9 114.1c5.6 7.4 77.7 118.6 188.4 166.5 70 30.2 97.4 32.8 132.4 27.6 21.3-3.2 65.2-26.6 74.3-52.5 9.1-25.8 9.1-47.9 6.4-52.5-2.7-4.9-10.1-7.7-21-13z" />
                <path d="m925.2 338.4c-22.6-53.7-55-101.9-96.3-143.3-41.3-41.3-89.5-73.8-143.3-96.3c630.6 75.7 572.2 64 512 64h-2c-60.6.3-119.3 12.3-174.5 35.9-53.3 22.8-101.1 55.2-142 96.5-40.9 41.3-73 89.3-95.2 142.8-23 55.4-34.6 114.3-34.3 174.9.3 69.4 16.9 138.3 48 199.9v152c0 25.4 20.6 46 46 46h152.1c61.6 31.1 130.5 47.7 199.9 48h2.1c59.9 0 118-11.6 172.7-34.3 53.5-22.3 101.6-54.3 142.8-95.2 41.3-40.9 73.8-88.7 96.5-142 23.6-55.2 35.6-113.9 35.9-174.5.3-60.9-11.5-120-34.8-175.6zm-151.1 438c704 845.8 611 884 512 884h-1.7c-60.3-.3-120.2-15.3-173.1-43.5l-8.4-4.5h188v695.2l-4.5-8.4c155.3 633.9 140.3 574 140 513.7c-.4-99.7 37.7-193.3 107.6-263.8 69.8-70.5 163.1-109.5 262.8-109.9h1.7c50 0 98.5 9.7 144.2 28.9 44.6 18.7 84.6 45.6 119 80 34.3 34.3 61.3 74.4 80 119 19.4 46.2 29.1 95.2 28.9 145.8-.6 99.6-39.7 192.9-110.1 262.7z" />
            </svg>
        </a>
    </div>

    <div class="cookie" id="cookie-notification">
        <div class="container cookie__inner">
            <p class="cookie__text">
                на этом сайте не используются файлы <a href="/cookie" target="_blank">cookie</a>.
            </p>
            <button class="cookie__btn simple-button simple-button_light  js-cookie-accept">
                <span>ok</span>
                <svg width="20px" height="20px" viewbox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink">
                    <path d="m12,2 c12.7139344,2 13.4186669,2.07493649 14.1058513,2.22228153 c14.6865234,2.34678839 14.8990219,3.06470877 14.4796691,3.48521478 c14.0147885,3.95137375 13.75,4.57867916 13.75,5.25 c13.75,6.42043414 14.5611837,7.42718287 15.6858365,7.68625206 c16.0559035,7.77149876 16.3038519,8.11989963 16.2631619,8.49747198 c16.2544079,8.57870262 16.25,8.66307444 16.25,8.75 c16.25,10.1307119 17.3692881,11.25 18.75,11.25 c19.4766017,11.25 20.151276,10.9392994 20.6235262,10.4053218 c21.0526462,9.92011177 21.8536336,10.1704416 21.9300905,10.8136579 c21.9765784,11.2047517 22,11.6008646 22,12 c22,17.5228475 17.5228475,22 12,22 c6.4771525,22 2,17.5228475 2,12 c2,6.4771525 6.4771525,2 12,2 z m12,3.5 c7.30557963,3.5 3.5,7.30557963 3.5,12 c3.5,16.6944204 7.30557963,20.5 12,20.5 c16.4367197,20.5 20.0795061,17.1007677 20.4660785,12.7645841 l20.4850437,12.5084524 l20.492,12.351 l20.2985099,12.4390561 c19.9679152,12.5778546 19.6173377,12.672508 19.2549465,12.7182945 l18.9810657,12.743398 l18.75,12.75 c16.7439233,12.75 15.0827631,11.2732368 14.7943277,9.34751855 l14.7694285,9.14674696 l14.755,8.96 l14.6100904,8.89964226 c13.3259006,8.32272189 12.4198681,7.0959893 12.2714595,5.6656449 l12.2549278,5.44962193 l12.25,5.25 c12.25,4.80312661 12.3237894,4.36763736 12.4635899,3.95776709 l12.5553294,3.71503308 l12.64,3.525 l12.363736,3.50762946 l12,3.5 z m15,16 c15.5522847,16 16,16.4477153 16,17 c16,17.5522847 15.5522847,18 15,18 c14.4477153,18 14,17.5522847 14,17 c14,16.4477153 14.4477153,16 15,16 z m8,15 c8.55228475,15 9,15.4477153 9,16 c9,16.5522847 8.55228475,17 8,17 c7.44771525,17 7,16.5522847 7,16 c7,15.4477153 7.44771525,15 8,15 z m12,11 c12.5522847,11 13,11.4477153 13,12 c13,12.5522847 12.5522847,13 12,13 c11.4477153,13 11,12.5522847 11,12 c11,11.4477153 11.4477153,11 12,11 z m7,8 c7.55228475,8 8,8.44771525 8,9 c8,9.55228475 7.55228475,10 7,10 c6.44771525,10 6,9.55228475 6,9 c6,8.44771525 6.44771525,8 7,8 z" fill="none"></path>
                </svg>
            </button>
        </div>
    </div>

    <script src="js/vendor.js"></script>
    <script src="js/main.js"></script>
</body>

</html>